let philArr = new Array( 
    {
        question: "Кто написал «Капитал» и «Манифест Коммунистической партии»?",
        answers: ["Джон Локк", "Владимир Ленин", "Карл Маркс", "Фридрих Ницше"],
        checkAnswers: [false, false, true, false],
        info: "Теории Маркса об обществе, экономике и политике, в совокупности понимаемые как марксизм, утверждают, что человеческие общества развиваются посредством классовой борьбы. При капитализме это проявляется в конфликте между правящими классами (известными как буржуазия), которые контролируют средства производства, и рабочими классами (известными как пролетариат), которые используют эти средства, продавая свою рабочую силу в обмен на заработную плату.",
        image: "assets/images/phil1.jpg",
    },

    {
        question: "Основной рабочий метод Ф. Бэкона - это:",
        answers: ["Анализ", "Синтез", "Индукция", "Дедукция"],
        checkAnswers: [false, false, true, false],
        info: "Его работы являются основанием и популяризацией индуктивной методологии научного исследования, часто называемой методом Бэкона. Индукция получает знание из окружающего мира через эксперимент, наблюдение и проверку гипотез, а не из толкования, например, древних текстов Аристотеля. Под индукцией Бэкон понимал обобщение множества частных явлений и получение на основе обобщения общих выводов (например, если многие отдельные металлы плавятся, то, значит, все металлы обладают свойством плавления).",
        image: "assets/images/phil2.jpg",
    },

    {
        question: "Согласно психоаналитическому учению 3.Фрейда, жизнь в целом и большинство конкретных поступков человека определяется:",
        answers: ["Мышлением", "Разумом", "Рассудком", "Бессознательным"],
        checkAnswers: [false, false, false, true],
        info: "Психоаналитическая теория Фрейда предполагает, что поведение обусловливается психологическими силами, согласуясь с положением психического детерминизма. Бессознательные силы часто пересиливают сознательные, продуцируя симптомы неврозов, сновидения и ошибки в повседневной жизни.",
        image: "assets/images/phil3.jpg",
    },

    {
        question: "Кто сказал знаменитую фразу: «Жизнь может быть понятна только назад, но она должна быть прожита вперёд»?",
        answers: ["Зигмунд Фрейд", "Джон Стюарт Милль", "Серен Кьеркегор", "Иммануил Кант"],
        checkAnswers: [false, false, true, false],
        info: "Серен Обье Кьеркегор был датским философом, теологом, поэтом, социальным критиком и религиозным писателем, которого многие считают первым философом-экзистенциалистом. Он писал критические тексты об организованной религии, христианском мире, морали, этике, психологии и философии религии, проявляя пристрастие к метафорам, иронии и притчам. Большая часть его философских работ посвящена вопросам того, как человек живет как «одинокий человек», отдавая приоритет конкретной человеческой реальности над абстрактным мышлением и подчеркивая важность личного выбора и приверженности.",
        image: "assets/images/phil4.jpg",
    },

    {
        question: "Кто первоначально сказал: «Я мыслю, следовательно, существую»?",
        answers: ["Фридрих Ницше", "Рене Декарт", "Николо Макиавелли", "Фрэнсис Бэкон"],
        checkAnswers: [false, true, false, false],
        info: "Рене Декарта часто называют «отцом современной философии». Этот титул оправдан как его разрывом с преобладавшей в его время традиционной схоластико-аристотелевской философией, так и его развитием и продвижением новых, механистических наук.",
        image: "assets/images/phil5.jpg",
    },

    {
        question: "Кому принадлежит высказывание: «Относись к людям так, как ты хотел бы, чтобы они относились к тебе»?",
        answers: ["Лаю-цзы", "Конфуцию", "Вардхамане Махавире", "Сиддхартхе Гаутаме"],
        checkAnswers: [false, true, false, false],
        info: "Другие высказывания Конфуция: -Три пути ведут к знанию: путь размышления — это путь самый благородный, путь подражания — это путь самый легкий и путь опыта — это путь самый горький. -Если ты ненавидишь – значит тебя победили.-Перед тем как мстить, вырой две могилы.-На самом деле, жизнь проста, но мы настойчиво её усложняем.-Благородный человек предъявляет требования к себе, низкий человек предъявляет требования к другим.-Достойный человек не идет по следам других людей.",
        image: "assets/images/phil6.jpg",
    },

    {
        question: "Кто впервые выдвинул атомистическую гипотезу строения материи?",
        answers: ["Августин", "Спиноза", "Демокрит", "К. Маркс"],
        checkAnswers: [false, false, true, false],
        info: "Ученым-энциклопедистом, крупнейшим представителем атомистического направления в философии был Демокрит (ок. 460–370 гг. до н. э.) из города Абдеры – греческой колонии на Фракийском побережье.",
        image: "assets/images/phil7.jpg",
    },

    {
        question: "Как расшифровывается термин «философия»?",
        answers: ["«Любовь к мудрости» ", "«Любовь к знаниям» ", "«Любовь к вечности» ", "«Любовь к науке» "],
        checkAnswers: [true, false, false, false],
        info: "Философия — это особая форма теоретико-познавательной мыслительной деятельности человека, направленная на всеобъемлющее рациональное осмысление мира и бытия человека в нём. Под философией также понимают исторически развивающуюся совокупность результатов этой деятельности и систему теоретических положений, в рамках которой она осуществляется. Философия (от греч. phileo - люблю и sophia - мудрость) буквально означает «любовь к мудрости».",
        image: "assets/images/phil8.jpg",
    },

    {
        question: "Кто является основоположником позитивизма?",
        answers: ["Э.Дюркгейм", "М.Вебер", "О.Конт", "К. Маркс"],
        checkAnswers: [false, false, true, false],
        info: "Французский мыслитель Огюст Конт считал, что накопление положительного, позитивного опыта, дисциплинаризация научной деятельности, исследование индуктивных логических процедур опытного знания являются тем единственным, что достойно внимания позитивной философии. Он сформулировал закон постоянного подчинения воображения наблюдению, с точки зрения которого наблюдение – универсальный метод приобретения знания. О. Конт утверждал: для того чтобы понять позитивный метод, нужно изучать его приложения, поэтому психологи не правы, когда считают, что одним только чтением правил Ф. Бэкона или рассуждений Р. Декарта можно построить позитивный метод. ",
        image: "assets/images/phil9.jpg",
    },

    {
        question: "Впервые употребил слово «философия» и назвал себя «философом»? ",
        answers: ["Аристотель", "Сократ", "Цицерон", "Пифагор"],
        checkAnswers: [false, false, false, true],
        info: "Диоген Лаэртский приписывает первое использование этого слова Пифагору: «Философию философией, а себя философом впервые стал называть Пифагор, когда спорил в Сикионе с Леонтом, тираном Сикиона или Флиунта; мудрецом же, по его словам, может быть только бог, а не человек. Ибо преждевременно было бы философию называть «мудростью», а упражняющегося в ней – «мудрецом», как если бы он изострил уже свой дух до предела; а философ – это просто тот, кто испытывает влечение к мудрости». Эту же версию повторяет большинство авторов вузовских учебников по философии.",
        image: "assets/images/phil10.jpg",
    },

     {
        question: "Какой древнегреческий философ считал огонь основой всего?",
        answers: ["Анаксимен", "Цицерон", "Гераклит", "Анаксимандр"],
        checkAnswers: [false, false, true, false],
        info: "Гераклит объяснял естественным образом такие природные явления как ветер, молнии, гром, зарницы и другие. Основой всего Гераклит считал огонь. В его понимании огонь, с одной стороны, подобен праматерии у представителей милетской школы и является как первоосновой мира («архе»), так и основным элементом («стойхейрон»). С другой стороны, огонь является для него наиболее адекватным символом динамики развития, постепенности постоянных изменений. Об этом свидетельствует, например, его изречение, что мир возникает из огня и опять сгорает в определенные периоды в течение всего века; свершается это согласно судьбе.",
        image: "assets/images/phil11.jpg",
    },

    {
        question: "Суть космогонической гипотезы «Большого взрыва» состоит в предположении о том, что: ",
        answers: ["Вселенная погибнет в результате взрыва ядра Галактики", "В центре Галактики происходят регулярные взрывы, изменяющие пространственно-временные характеристики Вселенной", "Через несколько миллиардов лет Солнце взорвётся и уничтожит Землю", "Вселенная возникла в результате микроскопической частицы"],
        checkAnswers: [false, false, false, true],
        info: "Гипотеза Большого взрыва говорит, что очень давно (приблизительно 20 миллиардов лет назад) Вселенная была невероятно малых размеров. Ее радиус равнялся примерно 10–12 см, что близко к радиусу электрона. Мысленно разделите миллиметр на 100 миллиардов частей. Одна такая часть и есть 10–12 см. Говоря иначе, все бескрайнее невообразимое пространство нынешнего космоса, расстояния в котором измеряются миллионами световых лет, было спрессовано в предельно сжатом объеме, который являлся настолько малым, что его можно было бы назвать словом «ничто».",
        image: "assets/images/phil12.jpg",
    },


    {
        question: "Какой древнегреческий мыслитель считал, что главная задача состоит в самопознании?",
        answers: ["Платон", "Сократ", "Аристотель", "Пифагор"],
        checkAnswers: [false, true, false, false],
        info: "Сократ считал последовательное познание «себя самого» основой понимания этических принципов, отношения к полису и религии. В отличие от предшествовавших ему материалистов, которые искали ответы на вопросы, касающиеся человека, прежде всего в его отношении к природе и призывали «прислушиваться к природе», Сократ подчеркивал значение совести, «внутреннего голоса», который он называл даймонионом и который был гарантией постижения подлинной истины.",
        image: "assets/images/phil13.jpg",
    },

    {
        question: "Какие философы являются видными представителями структурализма?",
        answers: ["М. Хайдеггер, С. де Бовуар", "Ю. Хабермас, К. Поппер", "Ф. Де Соссюр, К. Леви-Стросс", "Левкиппом, Демокрит Абдерский"],
        checkAnswers: [false, false, true, false],
        info: "Видными представителями структурализма являются Ф. Де Соссюр и К. Леви-Стросс. В самом общем виде структурализм — это философский подход, который утверждает, что объекты изучения в социальных и гуманитарных науках имеют относительную, а не субстанциональную природу (социальная реляционная онтология). Социальный мир объясняется не в терминах индивидуального действия, а через отношения и отношения между отношениями; целое образуется как их дифференциальная артикуляция. ",
        image: "assets/images/phil14.jpg",
    },

    {
        question: "Материализм – это:",
        answers: ["Признание первичности природы, материи и вторичности, зависимости идеального начала, сознания", " Признание того, что весь мир, все тела и предметы состоят из одинаковых частиц - атомов, молекул и т.п.", " Практический, здравый взгляд на вещи", " Признание самостоятельного, независимого от божественного вмешательства существования мира"],
        checkAnswers: [true, false, false, false],
        info: "Материали́зм (от лат. materialis — вещественный) — философское мировоззрение, в соответствии с которым материя, как объективная реальность, является онтологически первичным началом (причиной, условием, ограничением) в сфере бытия, а идеальное (понятия, воля, сознание и тому подобное) — вторичным (результатом, следствием).Законы материального мира распространяются на весь мир, в том числе на общество и человека.",
        image: "assets/images/phil15.jpg",
    },

    {
        question: "Представители материализма:",
        answers: ["Гегель, Маркс", "Платон", "Демокрит, Маркс", "Беркли, Демокрит"],
        checkAnswers: [false, false, true, false],
        info: "Представителями материализма являются Демокрит и Маркс. Главным достижением философии Демокрита считается развитие им учения Левкиппа (была даже теория, что Левкипп — это имя молодого Демокрита) об «атоме» — неделимой частице вещества, обладающей истинным бытием, не разрушающейся и не возникающей (атомистический материализм). Он описал мир как систему атомов в пустоте, отвергая бесконечную делимость материи, постулируя не только бесконечность числа атомов во Вселенной, но и бесконечность их форм. Высшей и самой последовательной формой материализма стал созданный Марксом и Энгельсом к середине 19 в. диалектический материализм. Теоретическими источниками им служили гегелевская диалектика и материализм Фейербаха, а через него и французский материализм 18 в.",
        image: "assets/images/phil16.jpg",
    },

    {
        question: "Философское учение о ценностях – это:",
        answers: ["Онтология", "Аксиология", "Гносеология", "Антропология"],
        checkAnswers: [false, true, false, false],
        info: "Аксиоло́гия (от др.-греч. ἀξία «ценность» + λόγος «слово, учение») — теория ценностей, раздел философии. Аксиология изучает вопросы, связанные с природой ценностей, их местом в реальности и структурой ценностного мира, то есть о связи различных ценностей между собой, с социальными и культурными факторами и структурой личности",
        image: "assets/images/phil17.jpg",
    },

    {
        question: "Даосизм считается философией:",
        answers: ["Конфуция", "Мо-цзы", "Лао-цзы", "Цзоу Яня"],
        checkAnswers: [false, false, true, false],
        info: "Основы даосизма, философии Лао-цзы излагаются в трактате «Дао Дэ цзин» (IV—III вв. до н. э.). В центре доктрины — учение о великом Дао, всеобщем Законе и Абсолюте. Дао многозначно, это бесконечное движение. Дао — своего рода закон бытия, космоса, универсальное единство мира. Дао господствует везде и во всём, всегда и безгранично. Его никто не создал, но всё происходит от него, чтобы затем, совершив кругооборот, снова в него вернуться. Невидимое и неслышимое, недоступное органам чувств, постоянное и неисчерпаемое, безымянное и бесформенное, оно даёт начало, имя и форму всему на свете. Даже великое Небо следует Дао.",
        image: "assets/images/phil18.jpg",
    },

    {
        question: "Идеализм – это:",
        answers: ["Утверждение, что идеи, мысли существуют реально", "Стремление обосновать значение идеалов в жизни, стремление человека к совершенству", "Стремление обосновать божественные истоки и сущность мира", "Признание идеального начала первичным, определяющим материальное"],
        checkAnswers: [false, false, false, true],
        info: "Идеали́зм (фр. idéalisme, через лат. idealis от др.-греч. ἰδέα — идея) — термин для обозначения широкого спектра философских концепций и мировоззрений, в основе которых лежит утверждение о первичности идеи по отношению к материи (см. Основной вопрос философии) в сфере бытия. Во многих историко-философских трудах проводится дихотомия, считающая противопоставление идеализма материализму как сущность философии. Идеализм утверждает первичность в сфере бытия идеального духовного по отношению к материальному. Термин «идеализм» появился только в XVIII веке. Впервые его употребил Лейбниц, говоря о философии Платона.",
        image: "assets/images/phil19.png",
    },

    {
        question: "Агностицизм – это:",
        answers: ["Теория познания", "Отрицание сотворения мира Богом", "Признание принципиальной непознаваемости окружающего мира", "Признание относительности любого человеческого знания"],
        checkAnswers: [false, false, true, false],
        info: "Агностици́зм (от др.-греч. ἄγνωστος — непознаваемый)— философская концепция, согласно которой мир непознаваем и люди не могут знать ничего достоверного о действительной сущности вещей, позиция религиозного агностицизма заключается в том, что люди не могут знать ничего достоверного о Боге (или богах). Для агностиков существование Бога, божественного или сверхъестественного неизвестно или непостижимо.",
        image: "assets/images/phil20.jpeg",
    },

    {
        question: "Элементы, входящие в учение о пяти стихиях в Древнем Китае:",
        answers: ["Вода, воздух, огонь", "Воздух, металл, огонь", "Вода, огонь, металл", "Дерево, земля, воздух"],
        checkAnswers: [false, false, true, false],
        info: "У-син (пять элементов; пять стихий; пять действий; пять движений; пять столбцов; пять фаз; пять состояний) — одна из основных категорий китайской философии; пятичленная структура, определяющая основные параметры мироздания. Это огонь (火), вода (水), дерево (木), металл (金) и земля (土).Включает в себя пять классов (дерево, огонь, земля, металл, вода), характеризующих состояние и взаимосвязь всех существующих предметов и явлений. Взаимопорождение состоит в следующем: дерево порождает огонь, огонь порождает землю, земля порождает металл, металл порождает воду, вода порождает дерево.Взаимопреодоление состоит в следующем: дерево побеждает землю, земля побеждает воду, вода побеждает огонь, огонь побеждает металл, металл побеждает дерево.",
        image: "assets/images/phil21.jpg",
    },

    {
        question: "Автор апорий «Ахиллес и черепаха», «Стрела», «Дихотомия», «Стадион» и др.:",
        answers: ["Гераклит", "Парменид", "Зенон Элейский", "Сократ"],
        checkAnswers: [false, false, true, false],
        info: "Зено́н Эле́йский (Элеатский; др.-греч. Ζήνων ὁ Ἐλεάτης; около 490 до н. э., Элея, Лукания — около 430 до н. э., там же) — древнегреческий философ, ученик Парменида, представитель Элейской школы. Знаменит своими апори́ями, которыми он пытался доказать противоречивость концепций движения, пространства и множества. Научные дискуссии, вызванные этими парадоксальными рассуждениями, существенно углубили понимание таких фундаментальных понятий, как роль дискретного и непрерывного в природе, адекватность физического движения и его математической модели и др. Эти дискуссии продолжаются и в настоящее время.",
        image: "assets/images/phil22.jpg",
    },

    {
        question: "Античный философ, назвавший свой диалектический метод майевтикой:",
        answers: ["Аристотель", "Гераклит", "Платон", "Сократ"],
        checkAnswers: [false, false, false, true],
        info: "Сократ разработал специфическую концепцию диалектики как искусства исследования понятий с целью постижения истины. Суть его метода заключалась в том, что сначала наводящими и уточняющими вопросами собеседник приводился к противоречию с высказанной им точки зрения, а затем начинался совместный поиск истины. Для Сократа истина не возникала и не находилась в голове отдельного человека в готовом виде, а рождалась в процессе диалога м/д собеседниками, совместно ищущими истину. Поэтому свой метод Сократ называл майевтикой, т.е. повивальным искусством, помогающим рождению истины.",
        image: "assets/images/phil23.jpg",
    },

    {
        question: "В основе теоцентризма – характерной черты средневековой философии – лежит представление о главенстве:",
        answers: ["Бога", "Человека", "Космоса", "Природы"],
        checkAnswers: [true, false, false, false],
        info: "Теоцентризм (от греч. theos - Бог и лат. centrum - центр круга) - англ. theocentrism; нем. Theozentrismus. Теологическая концепция, согласно которой Бог, понимаемый как абсолютное, совершенное бытие и наивысшее благо, выступает источником всякого бытия и блага. Подражение и уподобление Богу рассматривается при этом как высшая цель и главный смысл человеческой жизни, а почитание Бога и служение ему - как основа нравственности. В средние века основной формой философствования становится теоцентризм. Утверждается идея о том, что природа и человек – это творения Бога. Основными проблемами философии становятся «Бог – человек – природа», «вера и знание», «предназначение человека», «надежда и упование",
        image: "assets/images/phil24.jpg",
    },

    {
        question: "Создатель формальной логики:",
        answers: ["Аристотель", "Эпикур", "Сократ", "Парменид"],
        checkAnswers: [true, false, false, false],
        info: "Форма́льная ло́гика — наука о правилах преобразования высказываний, сохраняющих их истинностное значение безотносительно к содержанию входящих в эти высказывания понятий, а также конструирование этих правил. Будучи основателем формальной логики как науки, Аристотель называл её «аналитика», термин же «логика» прочно вошёл в обиход уже после его смерти в III веке до нашей эры.",
        image: "assets/images/phil25.jpg",
    },

    {
        question: "Представитель диалектической традиции в философии:",
        answers: ["Фалес", "Демокрит", "Эпикур", "Гераклит"],
        checkAnswers: [false, false, false, true],
        info: "Гераклит – великий древнегреческий диалектик. Диалектика у Гераклита, как и у его предшественников, — это прежде всего констатация и фиксирование вечности происходящих в мире изменений. Мысль об изменениях у Гераклита приобретает формуфило­софской идеи. Все изменяется, и изменяется постоянно; нет предела изменениям; они есть всегда, везде и во всем — вот что сказано в знаменитой краткой формуле, приписываемой Гераклиту:«Все течет, все изменяется».Специфика диалектики Гераклита — еще и в том, что мысль об изменениях объединяется здесь сидеей единства и борьбы противоположностей.",
        image: "assets/images/phil26.jpg",
    },

    {
        question: "Какая пара философских направлений получила преимущественное развитие в эпоху Средневековья?",
        answers: ["Реализм и номинализм", "Эмпиризм и рационализм", "Диалектика и метафизика", "Скептицизм и агностицизм"],
        checkAnswers: [true, false, false, false],
        info: "Номинализм и реализм (от лат. nomen - имя, realis - действительный) - противоборствующие направления средневековой схоластической философии. Номинализм настаивал на объективном существовании лишь единичных вещей. Реализм утверждал объективное существование общих понятий в Божественном уме. Для крайних номиналистов общие понятия суть звук, для умеренных общие понятия возникают в человеческом уме в процессе абстрагирования. Крайние реалисты (Эриугена) утверждали, что универсалии (общие идеи, понятия) существуют идеально, до вещей. Умеренные реалисты (Фома Аквинский) считали, что универсалии существуют в вещах. Дискуссия номиналистов и реалистов оттачивала логику, основное достижение средневековой схоластики, способствовала развитию научной строгости, заложила основы теории множеств и математической логики.",
        image: "assets/images/phil27.jpg",
    },

    {
        question: "«Пять путей от мира к Богу» в философии Фомы Аквинского:",
        answers: ["Пять способов обретения истинной веры", "Пять догматов христианского вероучения", "Пять логических доказательств бытия Бога", "Пять заповедей христианской морали"],
        checkAnswers: [false, false, true, false],
        info: "Фома Акви́нский (иначе Фома Аквинат, Томас Аквинат, лат. Thomas Aquinas) — итальянский философ и теолог, канонизирован католической церковью как святой, систематизатор ортодоксальной схоластики, учитель Церкви, Doctor Angelicus, Doctor Universalis, «princeps philosophorum» («князь философов»), основатель томизма, член ордена доминиканцев; с 1879 года признан наиболее авторитетным католическим религиозным философом, который связал христианское вероучение (в частности, идеи Августина Блаженного) с философией Аристотеля. Сформулировал пять доказательств бытия Бога. Признавая относительную самостоятельность естественного бытия и человеческого разума, утверждал, что природа завершается в благодати, разум — в вере, философское познание и естественная теология, основанная на аналогии сущего, — в сверхъестественном откровении.",
        image: "assets/images/phil28.jpg",
    },

    {
        question: "Формула «Все есть число» является краеугольным камнем учения",
        answers: ["Пифагорейцев", "Cофистов", "Cтоиков", "Cкептиков"],
        checkAnswers: [true, false, false, false],
        info: "Пифагорейцы были эллинской сектой, чьи отношения с миром математики выходили далеко за рамки чисто интеллектуальных интересов. Они считали, что все в природе следует правилам чисел и что суть всего, что существует, заключается в этих элементах. Таким образом, математика была задумана как священный элемент, который структурировал материю и идеи. Эту преданность числам и их взаимосвязям можно понять, если учесть, что математика, по-видимому, описывает формальную механику мира: ее законы применяются в любое время и в любом месте.",
        image: "assets/images/phil29.jpg",
    },

    {
        question: "Главная идея Гераклита, которая была проиллюстрирована им через образ реки:",
        answers: ["«Все течет, все изменяется»", "«Все имеет начало и конец»", "«Все полно богов»", "Нет ничего в разуме, чего до этого не было бы в опыте"],
        checkAnswers: [true, false, false, false],
        info: "«Все течет, все меняется» - афоризм, приписываемый Гераклиту Эфесскому. В учебниках философии учение Гераклита обычно противопоставляется учению элеатов, полагавших бытие в качестве неподвижного монолита. У Гераклита же все изменчиво, подвижно, находится в постоянном движении и борьбе. В мире нет ничего постоянного и устойчивого. Абсолютная и безостановочная изменяемость всех вещей, переход противоположностей друг в друга позволяет считать Гераклита одним из основоположников диалектики.",
        image: "assets/images/phil30.jpg",
    }
);

const maxQuestionTime = 20000;

let rigthAnswers;    
let wrongAnswers;    
let unansweredQuestions;   
let curQuestion;    

let timerId;
let questionTime = maxQuestionTime/1000;

let buttonArr = new Array(philArr[0].answers.length-1);

function startGame(){
    rigthAnswers = 0;    
    wrongAnswers = 0;    
    unansweredQuestions = 0;   
    curQuestion = 0;   

    intro.setAttribute("style", "display: none");

    startLevel();
}

function startLevel(){
    container.setAttribute("style", "margin-top: 100px");
    image.setAttribute("style", "display: none");   
    if (curQuestion === philArr.length){
        endGame();
    } else{
        question.innerHTML = "Вопрос " + (curQuestion+1);

        questionTime = maxQuestionTime/1000;
        headerText.innerHTML = "Осталось <span class=\"time\">" + questionTime + "</span> секунд";

        mainText.innerHTML = philArr[curQuestion].question;

        mainButton.onclick = function(){endLevel(0)};
        mainButton.innerHTML = philArr[curQuestion].answers[0];

        for (let i = 0; i < buttonArr.length; i++){
            buttonArr[i] = document.createElement("button");
            buttonArr[i].className = "button";
            buttonArr[i].onclick = function(){endLevel(i+1)};
            buttonArr[i].innerHTML = philArr[curQuestion].answers[i+1];
            document.getElementsByClassName("buttonWrapper")[0].append(buttonArr[i]);
        }

        timerId = setInterval(checkTime, 1000);
    }
}

function checkTime(){
    questionTime--;
    headerText.innerHTML = "Осталось <span class=\"time\">" + questionTime + "</span> секунд";
    if (questionTime === 0){
        endLevel(-1);
    }
}

function endLevel(status){
    clearInterval(timerId);
    container.setAttribute("style", "margin-top: 10px");
    question.innerHTML = "";
    for (let i = 0; i < buttonArr.length; i++){
        buttonArr[i].remove();
    }  

    if (status === -1){
        unansweredQuestions++;
        headerText.innerHTML = "Время истекло!";
    } else {
        if (philArr[curQuestion].checkAnswers[status] === true){
            rigthAnswers++;
            headerText.innerHTML = "<span class=\"g\">Правильный ответ!</span>";
        } else {
            wrongAnswers++;
            headerText.innerHTML = "<span class=\"r\">Неправильный ответ!</span>";
        }
    }

    mainText.innerHTML = philArr[curQuestion].info;

    image.setAttribute("style", "display: inline-block");
    image.src = philArr[curQuestion].image;

    curQuestion++;
    mainButton.onclick = startLevel;
    mainButton.innerHTML = "Продолжить";
}

function endGame(){
    mainButton.onclick = startGame;
    mainButton.innerHTML = "Начать заново";

    question.innerHTML = "Вы набрали: " + Math.round(100 * rigthAnswers / curQuestion) + "%";

    headerText.innerHTML = "Результаты";
    mainText.innerHTML = "Правильных ответов: <span class=\"g\">" + rigthAnswers + 
        "</span><br>Неправильных ответов: <span class=\"r\">" + wrongAnswers + 
        "</span><br>Неотвеченных вопросов: <span class=\"w\">" + unansweredQuestions + "</span>";
}
